package by.epam.training.module3;

public class Lesson3_2_04 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		// 3_2_04
		// С помощью оператора while напишите программу вывода всех четных чисел в
		// диапазоне от 2 до 100 включительно

		int a = 2;

		while (a <= 100) {
			System.out.println("a=" + a);
			a = a + 2;
		}
	}
}
